package lab3;

// Колода карт состоит из 36 листов.
// Колода перемешивается, а затем раздается полностью двум игрокам: 1-ая карта – 1-ому игроку, 2-ая карта – 2-ому игроку,
// 3-ая карта – 1-ому игроку, 4-ая карта – 2-ому игроку и т. д.
// Напишите программу, используя объектно-ориентированную методологию,
// котроая создает объект колода, выводит колоду на экран, перемешивает колоду, вновь выводит на экран,
// создает объекты игроков, раздает карт игрокам, выводит на экран последовательности карт каждого игрока.
// Используйте для хранения колоды и последовательностей карт только один массив из 36 элементов.
public class Main {
    public static void main(String[] args) {
        Card card = new Card(Suit.E_CLUBS, Value.ONE);
        System.out.println(card.suit + " Before ");
        card.suit = Suit.E_DIAMONDS;
        System.out.println(card.suit + " After ");
    }
}
